In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels = ['a', 'b','c']
my_data = [10,20,30]

arr = np.array(my_data)
d = {'a':[1,2],'b':2,'c':3}

In [4]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [5]:
ser = pd.Series(d)
ser

a    [1, 2]
b         2
c         3
dtype: object

In [6]:
ser[1]

2

#    DataFrames

In [7]:
np.random.seed(101)

In [8]:
df = pd.DataFrame(np.random.randn(5,4),['A', 'B', 'C', 'D', 'E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [10]:
df['V']=df['W']+df['Z']
df

          W         X         Y         Z         V
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [11]:
df.drop("V", axis=1, inplace=True)  #inplace makes it permamnent and axis selects which axis, 1 is the top one and 0 is the bottom one

In [12]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
#Getting boolean values
booldf = df>0 #linked to index
df[df>0] #linked to element in index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df[df['Z']>0][['Y','W']]

          Y         W
A  0.907969  2.706850
B -0.848077  0.651118
D -0.933237  0.188695
E  2.605967  0.190794

In [15]:
df[(df['W']>0)&(df['X']>1)] #&--> and operator
df[(df['W']>0)|(df['X']>1)] #&--> or operator

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
#resetting index back to 0-----n
df.reset_index() #we can make it permanent by using the inplace parameter

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [17]:
clubs = 'MUN TOT CHE MCI ARS'.split()
clubs

['MUN', 'TOT', 'CHE', 'MCI', 'ARS']

In [18]:
df['PremClubs'] = clubs

In [19]:
df

          W         X         Y         Z PremClubs
A  2.706850  0.628133  0.907969  0.503826       MUN
B  0.651118 -0.319318 -0.848077  0.605965       TOT
C -2.018168  0.740122  0.528813 -0.589001       CHE
D  0.188695 -0.758872 -0.933237  0.955057       MCI
E  0.190794  1.978757  2.605967  0.683509       ARS

In [20]:
#You can overwrite index by using
df.set_index('PremClubs')

                  W         X         Y         Z
PremClubs
MUN        2.706850  0.628133  0.907969  0.503826
TOT        0.651118 -0.319318 -0.848077  0.605965
CHE       -2.018168  0.740122  0.528813 -0.589001
MCI        0.188695 -0.758872 -0.933237  0.955057
ARS        0.190794  1.978757  2.605967  0.683509

In [21]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [22]:
df = pd.DataFrame(np.random.randn(6,2), hier_index, ['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [23]:
df.index.names = ['Groups','Number']
df

                      A         B
Groups Number
G1     1       0.302665  1.693723
       2      -1.706086 -1.159119
       3      -0.134841  0.390528
G2     1       0.166905  0.184502
       2       0.807706  0.072960
       3       0.638787  0.329646

In [24]:
df.loc['G2'].loc[1]['A']

0.16690463609281317

In [25]:
#Cross Section
df.xs(1, level='Number')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Handling Missing Data

In [26]:
new_df = {'a':[1,2,np.nan], 'b':[3,4, np.nan], 'c':[6, 7, 8]} 
df = pd.DataFrame(new_df)

In [27]:
df

     a    b  c
0  1.0  3.0  6
1  2.0  4.0  7
2  NaN  NaN  8

In [28]:
#df.index.names = ["SSSS"]
df.dropna()

     a    b  c
0  1.0  3.0  6
1  2.0  4.0  7

In [29]:
df.dropna(thresh=1)

     a    b  c
0  1.0  3.0  6
1  2.0  4.0  7
2  NaN  NaN  8

In [30]:
df.fillna(value="FILL IN")

         a        b  c
0      1.0      3.0  6
1      2.0      4.0  7
2  FILL IN  FILL IN  8

In [31]:
company= {'Company':['Tesla', 'Microsoft', 'NVIDIA'], 
          'Employees':['John', 'Jude', 'Joseph'], 
              'Salary':[200, 300, 500]}
company_df = pd.DataFrame(company)

In [32]:
company_df

     Company Employees  Salary
0      Tesla      John     200
1  Microsoft      Jude     300
2     NVIDIA    Joseph     500

In [33]:
group_by_company = company_df.groupby('Salary')

In [34]:
group_by_company.describe()

       Company                        Employees
         count unique        top freq     count unique     top freq
Salary
200          1      1      Tesla    1         1      1    John    1
300          1      1  Microsoft    1         1      1    Jude    1
500          1      1     NVIDIA    1         1      1  Joseph    1

# Operations

In [39]:
df  = pd.DataFrame({'col1':[1,2,3,4],
                    'col2':[444,555,666,888],
                    'col3':['abc', 'def', 'ghi', 'jkl']
    
})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   888  jkl

In [42]:
df['col2'].nunique()

4

In [43]:
df['col2'].value_counts()

col2
444    1
555    1
666    1
888    1
Name: count, dtype: int64

In [44]:
#applying functions
def multiply(x):
    return x*2

In [50]:
df['col2'].apply(lambda x: x*6) # or df['col2'].apply(multiply)

0    2664
1    3330
2    3996
3    5328
Name: col2, dtype: int64

In [54]:
df.columns
df.index

RangeIndex(start=0, stop=4, step=1)

In [57]:
df.sort_values(by='col3')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   888  jkl

In [58]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [59]:
data = {'A':['foo', 'foo', 'foo', 'bar', 'bar', 'bar'], 
      'B':['one', 'one', 'two', 'two', 'one', 'one'], 
      'C':['x', 'y', 'x', 'y', 'x', 'y'],
     'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [60]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [63]:
df.pivot_table(values='D', index=['A','B'], columns =['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN